"use client";
import React, { useState } from "react";
import TextInput from "@/components/SharedComponents/TextInput";

const BuyOpportunitiesTerms = () => {
  const Terms = [
    "لا يشترط الشراء للدخول في المسابقة.",
    "تخضع شروط المسابقة للقوانين والأنظمة الجارية في المملكة العربية السعودية.",
    "لا يحق لموظفي الغرف التجارية وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
    "لا يحق لموظفي الشركة المشغلة للنظام وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
    "لا يحق لموظفي وكالة الاعلان والدعاية وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
    "لا يحق لموظفي الشركة صاحبة المسابقة وعائلاتهم من الدرجة الاولي المشاركة في المسابقة الخاصة بها.",
    "لا يحق لموظفي المراكز التجارية المشاركة وعائلاتهم من الدرجة الاولي المشاركة في المسابقة الخاصة بها",
    "يجب ان يكون الاسم مطابق للهوية النظامية المعمول بها في المملكة العربية السعودية.",
    "في حال تبين أكثر من حساب لشخص واحد فسوف يتم الغاء جميع الحسابات بلا استثناء بما فيها الحساب الرئيسي وذلك لبيان تحايله علي الأنظمة وسيحرم من جميع الجوائز التي ربحها تحت هذه الحسابات",
    "للمقيمين في المملكة العربية السعودية كتابة الاسم بالكامل باللغة العربية كما هو موجود في الهوية النظامية (الهوية الوطنية, الهوية الخليجية, هوية مقيم, هوية زائر, جواز السفر).",
    "يجب علي جميع الفائزين ان تكون الهوية سارية المفعول عند استلام الجائزة.",
    "تغيير بيانات حساب قام بالمشاركة في مسابقة لم يتم السحب عليها بعد, يحرم صاحبه من الفوز فيها حتي وان فاز.",
    "في حال لم يتطابق اسم الفائز مع الاسم الموجود بالهوية النظامية المعتمدة في المملكة العربية السعودية يتم استبعاده واعادة السحب مرة اخري.",
    "تعبئة الاقرار ببيانات صحيحة حسب الهوية النظامية (الهوية الوطنية, الهوية الخليجية, هوية زائر, جواز السفر) والمرسل من قبل نظام (eCopon) الي جوال الفائز علي شكل رابط.",
    "قراءة (بطاقة استلام جائزة) المنشأة من نظام (eCopon) من قبل الشركة المنظمة للمسابقة يعد اقرارا من قبل الفائز باستلام الجائزة.",
    "يحق لشركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) رفع دعوي تحايل علي الأشخاص الذين قاموا بتعبئة نموذج الاقرار ببيانات غير صحيحة ولا تطابق الهوية النظامية (الهوية الوطنية, الهوية الخليجية, هوية زائر, جواز السفر).",
    "الدخول في المسابقة يعد موافقة ضمنية لشروطها وأحكامها.",
    "شركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) هي شركة مشغلة لنظام المسابقات فقط, ليس لها أي صلاحية علي نوع أو كمية الجوائز أو تسليمها أو استبدالها وانما يتم ذلك عن طريق الشركة أو الجهة راعية المسابقة أو المنظمة لها.",
    "شركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) هي شركة مشغلة لنظام المسابقات فقط, ليس لها أي علاقة في حال أخل احد الطرفين باي بند من بنود استلام (الفائز) أو تسليم (المنشأة) الجائزة",
    "أبل ليست مسئولة عن أي مسابقة من هذه المسابقات والمتواجدة في نظام وتطبيق eCopon, وانه ليس لها اي علاقة باي شكل من الاشكال بهذه المسابقات.",
  ];

  const [showAll, setShowAll] = useState(false);
  const handleToggle = () => {
    setShowAll(!showAll);
  };

  return (
    <div>
      {/* Terms Header */}
      <div className="flex flex-col items-start gap-4 mb-6">
        <h2 className="text-sm sm:text-2xl font-semibold text-shadeBlack">
          الشروط والأحكام الخاصة بالمسابقة
        </h2>
        <hr className="w-full border-gray-300" />
      </div>

      <ol className="list-inside">
        {Terms.map((term, index) => {
          if (!showAll && index >= 8) return null;
          const number = (index + 1).toString().padStart(2, "0");
          return (
            <li key={index} className="mb-1">
              {number} - {term}
            </li>
          );
        })}
      </ol>

      {!showAll && Terms.length > 5 && (
        <div className="flex justify-between items-center my-3">
          <button onClick={handleToggle} className="text-[#0080CC] font-semibold">
            عرض المزيد من التفاصيل
          </button>
          <svg
            width="14"
            height="8"
            viewBox="0 0 14 8"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M1 1L7 7L13 1"
              stroke="#0080CC"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>
        </div>
      )}

      {showAll && (
        <button onClick={handleToggle} className="text-[#0080CC] font-semibold my-4">
          إخفاء التفاصيل
        </button>
      )}

      <hr />

      <div className="flex flex-col items-start gap-4 my-6">
        <h2 className="text-sm sm:text-2xl font-semibold text-shadeBlack">
          معلومات الفرص
        </h2>
        <hr className="w-full border-gray-300" />
      </div>

      <div className="w-full pt-5 pb-5 gap-10 flex">
        <TextInput label="رصيد المحفظة" type="number" />
        <TextInput label="عدد كوبونات المسابقة" type="number" />
        <TextInput label="الرصيد" type="number" />
      </div>

      <hr />

    </div>
  );
};

export default BuyOpportunitiesTerms;
